ECOM Inventory Management Test

Approaching steps:  
1, ############### load files
2, ############### data inspection and data cleansing 
 
3, ############### data consolidation
4, ############### data analysis

Conclusion: Report Answers 
Q1.	Please provide a list of left-over inventory list including Item ID and inventory qty after deducting quantity from sales order files.

Q2.	Please provide a list daily performance table, includes Date, # of orders for the day and total qty of all items sold for the day.

Q3.	What is the best performing day in terms of # of orders and total item qty sold? 

Q4.	What are the Top 5 sold Item ID from those orders? 

Q5.	What is the average qty of items sold per order? 

q1 answer ~ q5 answer


Future Work: Automation and data visulization

In [244]:
import pandas as pd
import os
# 1, ######################## load files 
os.chdir(r"C:\Users\john\Repository\Myproj\miniso\dataset\sales order")
loanfile = os.listdir()
createVar = locals()
for i in loanfile:
    if i.endswith("csv"):        
        createVar[i.split('.')[0]] = pd.read_csv(i, encoding = 'gbk')
        print(i.split('.')[0])

orders1
orders2
orders3
orders4
orders5
orders6
orders7

In [139]:
inventory=pd.read_excel('Starting_Inventory.xlsx', index_col=0)

In [143]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 656 entries, 100019791 to 70200035731
Data columns (total 1 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Inventory Quantity  656 non-null    int64
dtypes: int64(1)
memory usage: 10.2 KB

In [245]:
# 2. #########################  data inspection 
orders1.describe()

SyntaxError: invalid syntax (<ipython-input-245-0b6debee41a5>, line 1)

In [31]:
orders1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114 entries, 0 to 113
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           114 non-null    object
 1   Order_ID       114 non-null    object
 2   Item_ID        114 non-null    int64
 3   Quantity_Sold  114 non-null    int64
dtypes: int64(2), object(2)
memory usage: 3.7+ KB

In [34]:
#od1= orders1.groupby(orders1['Date'])

In [22]:
orders1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114 entries, 0 to 113
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           114 non-null    object
 1   Order_ID       114 non-null    object
 2   Item_ID        114 non-null    int64
 3   Quantity_Sold  114 non-null    int64
dtypes: int64(2), object(2)
memory usage: 3.7+ KB

In [37]:
orders1.tail()

           Date   Order_ID        Item_ID  Quantity_Sold
109  2021-04-22       8572  2007163411108              1
110  2021-04-22       8572  2007169011104              1
111  2021-04-22       8572  2007163412105              1
112       44307  Y23970623  2007777210104              1
113       44307  Y23971195  2008484510105              1

In [44]:
################################ data cleansing 
orders1['Date'].iloc[-2:]='2021-04-22'

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [45]:
orders1.tail()

           Date   Order_ID        Item_ID  Quantity_Sold
109  2021-04-22       8572  2007163411108              1
110  2021-04-22       8572  2007169011104              1
111  2021-04-22       8572  2007163412105              1
112  2021-04-22  Y23970623  2007777210104              1
113  2021-04-22  Y23971195  2008484510105              1

In [52]:
orders1['Date'].unique()

array(['2021-04-21', '2021-04-22'], dtype=object)

In [53]:
orders3['Order_ID'].unique()

array(['8559', '8560', '8561', '8562', '8563', '8564', '8565', '8566',
       '8567', '8568', '8569', '8570', '8571', '8572', 'Y23970623',
       'Y23971195'], dtype=object)

In [60]:
orders3['Date'].unique()

array(['44309', '2021-04-23', '2021-04-24', '2021-04-25', '2021-04-26'],
      dtype=object)

In [70]:
orders3.loc[(orders3['Date']=='44309')]

    Date   Order_ID        Item_ID  Quantity_Sold
0  44309  Y24010332  2007270210106              1

In [74]:
############################## data cleansing 
orders3['Date'].iloc[0]='2021-04-23'

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [75]:
orders3.head()

         Date   Order_ID        Item_ID  Quantity_Sold
0  2021-04-23  Y24010332  2007270210106              1
1  2021-04-23       8595  2008182310106              1
2  2021-04-23       8595  2007498310107              1
3  2021-04-23       8595  2007235714106              1
4  2021-04-23       8595  2009462610107              1

In [76]:
orders4['Date'].unique()

array(['2021-04-26', '2021-04-27', '44311', '44312'], dtype=object)

In [79]:
orders4.loc[(orders4['Date'].isin(['44311', '44312']))]

      Date   Order_ID        Item_ID  Quantity_Sold
200  44311  Y24058650      500007232              1
201  44312  Y24077008  2007133310103              1

In [82]:
orders4.tail()

           Date   Order_ID        Item_ID  Quantity_Sold
197  2021-04-27       8675      300011552              1
198  2021-04-27       8675      300011551              1
199  2021-04-27       8676      300011552              4
200       44311  Y24058650      500007232              1
201       44312  Y24077008  2007133310103              1

In [83]:
orders4['Date'].iloc[-2:]='2021-04-27'

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [84]:
orders4.tail()

           Date   Order_ID        Item_ID  Quantity_Sold
197  2021-04-27       8675      300011552              1
198  2021-04-27       8675      300011551              1
199  2021-04-27       8676      300011552              4
200  2021-04-27  Y24058650      500007232              1
201  2021-04-27  Y24077008  2007133310103              1

In [85]:
orders5['Date'].unique()

array(['2021-04-27', '2021-04-28', '44313'], dtype=object)

In [86]:
orders5.loc[(orders5['Date']=='44313')]

      Date   Order_ID    Item_ID  Quantity_Sold
151  44313  Y24103771  100019791              1
152  44313  Y24109251  800020051              1

In [87]:
orders5.tail()

           Date   Order_ID        Item_ID  Quantity_Sold
148  2021-04-28       8698  2007293310104              1
149  2021-04-28       8699  2008117212109              1
150  2021-04-28       8699  2006986710108              1
151       44313  Y24103771      100019791              1
152       44313  Y24109251      800020051              1

In [91]:
############################## data cleansing 
tmp=orders5['Date'][150]
tmp

'2021-04-28'

In [92]:

orders5['Date'].iloc[-2:]=tmp

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [93]:
orders5.tail()

           Date   Order_ID        Item_ID  Quantity_Sold
148  2021-04-28       8698  2007293310104              1
149  2021-04-28       8699  2008117212109              1
150  2021-04-28       8699  2006986710108              1
151  2021-04-28  Y24103771      100019791              1
152  2021-04-28  Y24109251      800020051              1

In [94]:
orders6['Date'].unique()

array(['2021-04-28', '2021-04-29', '44314'], dtype=object)

In [97]:
orders6.groupby(['Date']).count()

            Order_ID  Item_ID  Quantity_Sold
Date
2021-04-28        37       37             37
2021-04-29        33       33             33
44314              2        2              2

In [104]:
############################## data cleansing 
orders6['Date'].loc[(orders6['Date']=='44314')]='2021-04-29'

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [105]:
orders6.tail()

          Date   Order_ID        Item_ID  Quantity_Sold
67  2021-04-29       8715  2007247613107              1
68  2021-04-29       8715  2007950110108              1
69  2021-04-29       8715  2007095910106              1
70  2021-04-29  Y24119724  2007773710103              1
71  2021-04-29  Y24121677      500007232              1

In [106]:
orders7.groupby(['Date']).count()

            Order_ID  Item_ID  Quantity_Sold
Date
2021-04-29        60       60             60
2021-04-30        18       18             18
44315              1        1              1

In [107]:
############################## data cleansing 
orders7['Date'].loc[(orders7['Date']=='44315')]='2021-04-30'

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [108]:
orders7.tail()

          Date   Order_ID        Item_ID  Quantity_Sold
74  2021-04-30       8729  2007304610100              1
75  2021-04-30       8729  2007237010107              1
76  2021-04-30       8729  2008810010101              1
77  2021-04-30       8729  2007962610108              1
78  2021-04-30  Y24141077  2007469710103              2

In [110]:
#3, ############### data consolidation

weekorders=orders1
weekorders.tail()

           Date   Order_ID        Item_ID  Quantity_Sold
109  2021-04-22       8572  2007163411108              1
110  2021-04-22       8572  2007169011104              1
111  2021-04-22       8572  2007163412105              1
112  2021-04-22  Y23970623  2007777210104              1
113  2021-04-22  Y23971195  2008484510105              1

In [117]:
weekorders= weekorders.append(orders2, ignore_index=True)

In [118]:
weekorders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 275 entries, 0 to 274
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           275 non-null    object
 1   Order_ID       275 non-null    object
 2   Item_ID        275 non-null    int64
 3   Quantity_Sold  275 non-null    int64
dtypes: int64(2), object(2)
memory usage: 8.7+ KB

In [119]:
weekorders.groupby(['Date']).count()

            Order_ID  Item_ID  Quantity_Sold
Date
2021-04-21       108      108            108
2021-04-22       165      165            165
2021-04-23         2        2              2

In [120]:
weekorders[112:120]

           Date   Order_ID        Item_ID  Quantity_Sold
112  2021-04-22  Y23970623  2007777210104              1
113  2021-04-22  Y23971195  2008484510105              1
114  2021-04-22       8573  2007979210100              1
115  2021-04-22       8573  2006953312106              1
116  2021-04-22       8573  2008051710105              1
117  2021-04-22       8573  2008070810107              1
118  2021-04-22       8573      400033491              1
119  2021-04-22       8573  2007950910104              1

In [121]:
weekorders= weekorders.append(orders3, ignore_index=True)

In [122]:
weekorders.groupby(['Date']).count()

            Order_ID  Item_ID  Quantity_Sold
Date
2021-04-21       108      108            108
2021-04-22       165      165            165
2021-04-23       119      119            119
2021-04-24       135      135            135
2021-04-25        46       46             46
2021-04-26         5        5              5

In [123]:
weekorders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 578 entries, 0 to 577
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           578 non-null    object
 1   Order_ID       578 non-null    object
 2   Item_ID        578 non-null    int64
 3   Quantity_Sold  578 non-null    int64
dtypes: int64(2), object(2)
memory usage: 18.2+ KB

In [124]:
orders3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           303 non-null    object
 1   Order_ID       303 non-null    object
 2   Item_ID        303 non-null    int64
 3   Quantity_Sold  303 non-null    int64
dtypes: int64(2), object(2)
memory usage: 9.6+ KB

In [125]:
weekorders= weekorders.append(orders4, ignore_index=True)

In [126]:
weekorders= weekorders.append(orders5, ignore_index=True)

In [127]:
weekorders= weekorders.append(orders6, ignore_index=True)

In [128]:
weekorders= weekorders.append(orders7, ignore_index=True)

In [129]:
weekorders.groupby(['Date']).count()

            Order_ID  Item_ID  Quantity_Sold
Date
2021-04-21       108      108            108
2021-04-22       165      165            165
2021-04-23       119      119            119
2021-04-24       135      135            135
2021-04-25        46       46             46
2021-04-26       191      191            191
2021-04-27       147      147            147
2021-04-28        59       59             59
2021-04-29        95       95             95
2021-04-30        19       19             19

In [130]:
# 4, ############### data analysis

weekorders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1084 entries, 0 to 1083
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           1084 non-null   object
 1   Order_ID       1084 non-null   object
 2   Item_ID        1084 non-null   int64
 3   Quantity_Sold  1084 non-null   int64
dtypes: int64(2), object(2)
memory usage: 34.0+ KB

In [163]:
weekorders.groupby('Item_ID').sum('Quantity_Sold').sort_values("Item_ID", ascending=True)

               Quantity_Sold
Item_ID
100019791                  1
100030402                  1
100031192                  1
100037442                  1
100037531                  1
...                      ...
2009463810100              9
2009498310101             10
2009610710109             16
2180168310010              1
2180919610410              1

[656 rows x 1 columns]

In [165]:
weekorders[weekorders['Item_ID']==2009463810100]

           Date Order_ID        Item_ID  Quantity_Sold
91   2021-04-21     8569  2009463810100              1
786  2021-04-27     8678  2009463810100              8

In [170]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 656 entries, 100019791 to 70200035731
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Inventory Quantity  656 non-null    int64
 1   quantity_sold       656 non-null    int64
dtypes: int64(2)
memory usage: 31.5 KB

In [161]:
inventory.sort_values("SKU", ascending=True)

               Inventory Quantity
SKU
100019791                     101
100030402                     101
100031192                     101
100037442                     101
100037531                     101
...                           ...
2009463810100                 109
2009498310101                 110
2009610710109                 116
2180168310010                 101
2180919610410                 101

[656 rows x 1 columns]

In [168]:
inventory['quantity_sold']=weekorders.groupby('Item_ID').sum('Quantity_Sold').sort_values("Item_ID", ascending=True)
inventory

             Inventory Quantity  quantity_sold
SKU
100019791                   101              1
100030402                   101              1
100031192                   101              1
100037442                   101              1
100037531                   101              1
...                         ...            ...
70200032351                 101              1
70200033311                 101              1
70200034111                 103              3
70200035561                 101              1
70200035731                 101              1

[656 rows x 2 columns]

In [171]:
inventory[inventory.index==2009463810100]

               Inventory Quantity  quantity_sold
SKU
2009463810100                 109              9

In [172]:
inventory[inventory.index==2009610710109]

               Inventory Quantity  quantity_sold
SKU
2009610710109                 116             16

In [252]:
# Conclusion: Report Answers 
# Q1.Please provide a list of left-over inventory list including Item ID and inventory qty after deducting quantity from sales order files.
# Q1 answer
inventory['Quantity_Remaining']=inventory['Inventory Quantity']-inventory['quantity_sold']
inventory

             Inventory Quantity  quantity_sold  Quantity_Remaining
SKU
100019791                   101              1                 100
100030402                   101              1                 100
100031192                   101              1                 100
100037442                   101              1                 100
100037531                   101              1                 100
...                         ...            ...                 ...
70200032351                 101              1                 100
70200033311                 101              1                 100
70200034111                 103              3                 100
70200035561                 101              1                 100
70200035731                 101              1                 100

[656 rows x 3 columns]

In [210]:
# Conclusion: Report Answers  
# Q2.Please provide a list daily performance table, includes Date, # of orders for the day and total qty of all items sold for the day.
# Q2 answer
#weekorders.info()
#q2=weekorders.groupby('Date').nunique('Order_ID')
#weekorders.groupby('Date').agg(num_order=('Order_ID',nunique()))
f={'Order_ID': 'nunique', 'Quantity_Sold': 'sum'}
q2=weekorders.groupby('Date').agg(f)
q2

            Order_ID  Quantity_Sold
Date
2021-04-21        13            116
2021-04-22        25            184
2021-04-23        24            128
2021-04-24        21            153
2021-04-25         8             50
2021-04-26        27            213
2021-04-27        25            187
2021-04-28        14             62
2021-04-29        17            122
2021-04-30         4             20

In [212]:
q2.sort_values(['Order_ID', 'Quantity_Sold'], ascending=False)
#weekorders.info()
#weekorders.groupby('Date').nunique('Order_ID').sum()
#weekorders.groupby('Date').sum()

            Order_ID  Quantity_Sold
Date
2021-04-26        27            213
2021-04-27        25            187
2021-04-22        25            184
2021-04-23        24            128
2021-04-24        21            153
2021-04-29        17            122
2021-04-28        14             62
2021-04-21        13            116
2021-04-25         8             50
2021-04-30         4             20

In [182]:
#weekorders[weekorders['Item_ID']==2009463810100]
weekorders['Order_ID'][weekorders['Date']=='2021-04-21'].unique()

array(['8559', '8560', '8561', '8562', '8563', '8564', '8565', '8566',
       '8567', '8568', '8569', '8570', '8571'], dtype=object)

In [215]:
# Conclusion: Report Answers 
# Q3.What is the best performing day in terms of # of orders and total item qty sold? 
# Q3 answer
q3=q2.sort_values(['Order_ID', 'Quantity_Sold'], ascending=False).head(1)
q3

            Order_ID  Quantity_Sold
Date
2021-04-26        27            213

In [217]:
# Conclusion: Report Answers 
# Q4. What are the Top 5 sold Item ID from those orders? 
# Q4 answer 
q4=weekorders.groupby('Item_ID').sum().sort_values('Quantity_Sold',ascending=False).head(5)
q4

               Quantity_Sold
Item_ID
300011552                 26
2009610710109             16
100044211                 11
2009462610107             11
400016382                 10

In [238]:
weekorders[['Order_ID','Quantity_Sold']].groupby('Order_ID').sum()

           Quantity_Sold
Order_ID
8573                  15
8574                  12
8575                  15
8576                   4
8577                   1
...                  ...
Y24103771              1
Y24109251              1
Y24119724              1
Y24121677              1
Y24141077              2

[177 rows x 1 columns]

In [243]:
# Conclusion: Report Answers
# Q5. What is the average qty of items sold per order? 
# Q5 answer
q5=weekorders[['Order_ID','Quantity_Sold']].groupby('Order_ID').sum().mean()
q5

Quantity_Sold    6.977401
dtype: float64

Future Work: Automation and data visulization could base on this code